#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Tue Apr 11 16:34:34 2023

remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/rtl/Camera_top.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/rtl/DDR3_interface_top.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/rtl/HDMI_top.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/rtl/ov5640_hdmi_test.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/rtl/Camera_top/cam_data_converter.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/rtl/Camera_top/ov5640_lut.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/rtl/Camera_top/sccb_driver.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/rtl/DDR3_interface_top/AXI_rw_FIFO.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/rtl/DDR3_interface_top/simplified_AXI.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/rtl/HDMI_top/iic_dri.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/rtl/HDMI_top/ms72xx_init.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/rtl/HDMI_top/ms7200_lut.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/rtl/HDMI_top/ms7210_lut.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/rtl/HDMI_top/video_display.v"
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/rtl/HDMI_top/video_driver.v"
remove_constraint  -logic -fdc "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ov5640_hdmi_test.fdc"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Camera_top.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/DDR3_interface_top.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/HDMI_top.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/video_stitching.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Camera_top/cam_data_converter.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Camera_top/ov5640_lut.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Camera_top/sccb_driver.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/DDR3_interface_top/AXI_rw_FIFO.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/DDR3_interface_top/simplified_AXI.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/HDMI_top/iic_dri.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/HDMI_top/ms72xx_init.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/HDMI_top/ms7200_lut.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/HDMI_top/ms7210_lut.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/HDMI_top/video_display.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/HDMI_top/video_driver.v"
add_constraint "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/video_stitching.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/axi_fifo_cam/axi_fifo_cam.idf
remove_design -force D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/pll/pll.idf
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/DDR3_interface_top/arbiter.v"
add_design D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/axi_fifo_hdmi/axi_fifo_hdmi.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
remove_design -force D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/axi_fifo_i/axi_fifo_i.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
add_fic "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/synthesize/video_stitching_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_fic "D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/synthesize/video_stitching_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
add_design D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/pll/pll.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
add_design D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/s_d_ram_1920x16/s_d_ram_1920x16.idf
add_design D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/s_d_ram_2048x16/s_d_ram_2048x16.idf
remove_design D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/s_d_ram_1920x16/s_d_ram_1920x16.idf
add_design D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/s_d_ram_2048x24/s_d_ram_2048x24.idf
remove_design -force D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/s_d_ram_2048x16/s_d_ram_2048x16.idf
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Video_processing_top.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Video_processing_top/bilinear_calculator.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Video_processing_top/bilinear_interpolation.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Video_processing_top/image_2x2.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
remove_design -force D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/pll/pll.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
remove_design -verilog "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/HDMI_top/video_display.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module Camera_top
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
add_design D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/axi_fifo_video0/axi_fifo_video0.idf
add_design D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/axi_fifo_video1/axi_fifo_video1.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
add_design D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/axi_fifo_video3/axi_fifo_video3.idf
add_design D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/axi_fifo_video2/axi_fifo_video2.idf
remove_design -force D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/axi_fifo_cam/axi_fifo_cam.idf
remove_design -force D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/axi_fifo_hdmi/axi_fifo_hdmi.idf
add_design D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/axi_fifo_video/axi_fifo_video.idf
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Ethernet_top.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Ethernet_top/arp.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Ethernet_top/gmii_to_rgmii.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Ethernet_top/udp_rx.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Ethernet_top/arp/arp_rx.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Ethernet_top/arp/arp_tx.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Ethernet_top/arp/crc32_d8.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Ethernet_top/gmii_to_rgmii/rgmii_rx.v"
add_design "D:/FPGA_projects/PANGOMICRO/video_stitching/rtl/Ethernet_top/gmii_to_rgmii/rgmii_tx.v"
remove_design -force D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/axi_fifo_video0/axi_fifo_video0.idf
remove_design -force D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/axi_fifo_video1/axi_fifo_video1.idf
remove_design -force D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/axi_fifo_video3/axi_fifo_video3.idf
remove_design -force D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/axi_fifo_video2/axi_fifo_video2.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
add_design D:/FPGA_projects/PANGOMICRO/video_stitching/pango_project/ipcore/pll_shift/pll_shift.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
add_design "D:/MY_FILE/FPGA/rtl/bilinear_interpolation.v"
add_design "D:/MY_FILE/FPGA/rtl/bilinear_top/asyn_fifo.v"
add_design "D:/MY_FILE/FPGA/rtl/bilinear_top/bin2gray.v"
add_design "D:/MY_FILE/FPGA/rtl/bilinear_top/bram_ture_dual_port.v"
add_design "D:/MY_FILE/FPGA/rtl/bilinear_top/double_syn_ff.v"
add_design "D:/MY_FILE/FPGA/rtl/bilinear_top/gray2bin.v"
remove_design -verilog "D:/MY_FILE/FPGA/rtl/bilinear_interpolation.v"
add_design "D:/MY_FILE/FPGA/rtl/bilinear_top.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
add_design "D:/MY_FILE/FPGA/pango_project/source/vs_va2vs.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
add_design "D:/MY_FILE/FPGA/rtl/Key_Module.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
add_design "D:/MY_FILE/FPGA/rtl/zmx_rotate.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
add_design "D:/MY_FILE/FPGA/rtl/VIP_RGB888_YCbCr444.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
add_design "D:/MY_FILE/FPGA/rtl/yuv_rgb.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module video_stitching
synthesize -ads -frequency {50} -selected_syn_tool_opt 2 
dev_map 
pnr -mode {performance} -fix_hold_violation -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_bit_stream -system_clock_frequency {50M} 
